aboutRedis/redisSetup.org
#+TITLE: Redis服务搭建说明
* 概述
本文档介绍xx系统中的redis搭建说明。
* 安装
** 下载安装包
下载当前官网发布的稳定版本(redis-3.2.6.tar.gz)
** 安装准备
创建用户，用于运行redis
#+BEGIN_SRC
useradd -s /bin/bash -m qzt_redis
#+END_SRC
** 安装
#+BEGIN_SRC
# 将安装包scp到/home/qzt_reids/software目录中
# 解压安装包
cd /home/qzt_redis/software
tar zxvf redis-3.2.6.tar.gz
cd redis-3.2.6
make PREFIX=/home/qzt_redis/redis install
cd /home/qzt_redis/redis
mkdir conf
cp /home/qzt_redis/software/redis-3.2.6/redis.conf conf/
mkdir db
mkdir logs
#+END_SRC
** 配置文件
#+BEGIN_SRC
# 修改/home/qzt_redis/redis/conf/redis.conf文件
bind 192.168.36.41
protected-mode no
daemonize yes
logfile "/home/qzt_redis/redis/logs/redis.log"
dir /home/qzt_redis/redis/db/
#+END_SRC
** 启动redis
#+BEGIN_SRC
/home/qzt_redis/redis/bin/redis-server /home/qzt_redis/redis/conf/redis.conf
#+END_SRC
