aboutRedis/redisSetup.html
<!doctype html>
<html lang="en">
<head>
<title>Redis服务搭建说明</title>
<!-- 2017-01-15 Sun 11:54 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="赵光建">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Redis服务搭建说明</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
本文档介绍xx系统中的redis搭建说明。
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 安装</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 下载安装包</h3>
<div class="outline-text-3" id="text-2-1">
<p>
下载当前官网发布的稳定版本(redis-3.2.6.tar.gz)
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 安装准备</h3>
<div class="outline-text-3" id="text-2-2">
<p>
创建用户，用于运行redis
</p>
<pre class="example">
useradd -s /bin/bash -m qzt_redis
</pre>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 安装</h3>
<div class="outline-text-3" id="text-2-3">
<pre class="example">
# 将安装包scp到/home/qzt_reids/software目录中
# 解压安装包
cd /home/qzt_redis/software
tar zxvf redis-3.2.6.tar.gz
cd redis-3.2.6
make PREFIX=/home/qzt_redis/redis install
cd /home/qzt_redis/redis
mkdir conf
cp /home/qzt_redis/software/redis-3.2.6/redis.conf conf/
mkdir db
mkdir logs
</pre>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 配置文件</h3>
<div class="outline-text-3" id="text-2-4">
<pre class="example">
# 修改/home/qzt_redis/redis/conf/redis.conf文件
bind 192.168.36.41
protected-mode no
daemonize yes
logfile "/home/qzt_redis/redis/logs/redis.log"
dir /home/qzt_redis/redis/db/
</pre>
</div>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 启动redis</h3>
<div class="outline-text-3" id="text-2-5">
<pre class="example">
/home/qzt_redis/redis/bin/redis-server /home/qzt_redis/redis/conf/redis.conf
</pre>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. 概述</a></li>
<li><a href="#sec-2">2. 安装</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. 下载安装包</a></li>
<li><a href="#sec-2-2">2.2. 安装准备</a></li>
<li><a href="#sec-2-3">2.3. 安装</a></li>
<li><a href="#sec-2-4">2.4. 配置文件</a></li>
<li><a href="#sec-2-5">2.5. 启动redis</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: 赵光建</p>
<p class="date">Created: 2017-01-15 Sun 11:54</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org-mode</a> 8.2.10)</p>
</div>
</footer>
</body>
</html>
